app/Controllers/Pages.php

    public function index()
    // if isset!login paakai return view index, if isset=login = true, return view footer,header, <<homepage>>
    {

        $dataProduk = $this->produk_layanan->findAll();
---
SELECT *
FROM `produk_layanan`
 LIMIT 10