app/Controllers/Pages.php

    public function index()
    // if isset!login paakai return view index, if isset=login = true, return view footer,header, <<homepage>>
    {

        $dataProduk = $this->produk_layanan->paginate(15, 'daftar_produk');
        // $dataProduk = $this->produk_layanan->findAll();
        $dataPaket = $this->paket_layanan->findAll();
---
SELECT *
FROM `produk_layanan`
SELECT COUNT(*) AS `numrows`
FROM `produk_layanan`
SELECT *
FROM `paket_layanan`